[
    {
        "id": 0,
        "href": "https://github.com/andrearcaina/vivid",
        "name": "vivid",
        "info": "is a full-stack web application for any general amateur or professional club that allows administrators to manage the finances, membership, and coaches of their club.",
        "description": "It includes user authentication, a messaging platform for all members and administrators, an expense tracking panel, and a membership management system for administration.",
        "technologies": "Django, Next.js + React.js, Supabase, PostgreSQL, TailwindCSS, WebSockets",
        "languages": "Python, JavaScript"
    },
    {
        "id": 1,
        "href": "https://github.com/andrearcaina/WizGallery",
        "name": "wizgallery",
        "info": "a full-stack web gallery app that displays photo taken images from Supabase.",
        "description": "has a simple search feature that allows you to search for images through a form. the app also has a feature that allows you to view all images from the database.",
        "technologies": "Flask, Next.js + React.js, PostgreSQL, TailwindCSS, Docker",
        "languages": "Python, JavaScript, SQL"
    },
    {
        "id": 2,
        "href": "https://github.com/andrearcaina/pyggle",
        "name": "pyggle",
        "info": "a boggle solver library written in python, and compiled onto the web.",
        "description": "find all possible words on a given a boggle board (either through interaction, text, or image) and a list of words (or no input), with a visual representation on how the algorithm works! the user can also see the score of each word found on the boggle board.",
        "technologies": "Flask, Pyggle, OpenCV, EasyOCR, Next.js + React.js, TailwindCSS",
        "languages": "Python, TypeScript"
    },
    {
        "id": 3,
        "href": "https://github.com/andrearcaina/Nectar",
        "name": "nectar",
        "info": "a full-stack web app that compares prices between user inputted products from several e-commerce websites.",
        "description": "has a form that allows users to input a given product, and scrapes Amazon to retrieve similar products around that price range and provides statistical models. Won best E-Commerce Theme and Best Use of GitHub for NewHacks2023.",
        "technologies": "Flask, BeautifulSoup4, Next.js + React.js, TailwindCSS",
        "languages": "Python, JavaScript"
    }
]